//! ASCII art and misc utilities.

pub const ASCII_AGENT_DIVA_LOGO: &str = r#"
  ▄▄▄▄    ▄▄▄▄▄▄▄   ▄▄▄▄▄▄▄ ▄▄▄    ▄▄▄ ▄▄▄▄▄▄▄▄▄    ▄▄▄▄▄▄   ▄▄▄▄▄ ▄▄▄▄  ▄▄▄▄   ▄▄▄▄   
▄██▀▀██▄ ███▀▀▀▀▀  ███▀▀▀▀▀ ████▄  ███ ▀▀▀███▀▀▀    ███▀▀██▄  ███  ▀███  ███▀ ▄██▀▀██▄ 
███  ███ ███       ███▄▄    ███▀██▄███    ███       ███  ███  ███   ███  ███  ███  ███ 
███▀▀███ ███  ███▀ ███      ███  ▀████    ███ ▀▀▀▀▀ ███  ███  ███   ███▄▄███  ███▀▀███ 
███  ███ ▀██████▀  ▀███████ ███    ███    ███       ██████▀  ▄███▄   ▀████▀   ███  ███                                                                                                                                                                                                            
"#;

/// Prints the Agent Diva ASCII logo to stdout.
pub fn print_ascii_agent_diva_logo() {
    println!("{}", ASCII_AGENT_DIVA_LOGO);
}
